Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/include/proc/p32mk0512gpg064.h
extern volatile __CNCONCbits_t CNCONCbits __asm__ ("CNCONC") __attribute__((section("sfrs"), address(0xBF860270)));
extern volatile uint32_t        CNCONCCLR __attribute__((section("sfrs"),address(0xBF860274)));
extern volatile uint32_t        CNCONCSET __attribute__((section("sfrs"),address(0xBF860278)));
extern volatile uint32_t        CNCONCINV __attribute__((section("sfrs"),address(0xBF86027C)));
#define CNENC CNENC
extern volatile uint32_t   CNENC __attribute__((section("sfrs"), address(0xBF860280)));
typedef union {
  struct {
    uint32_t CNIEC0:1;
    uint32_t CNIEC1:1;
    uint32_t CNIEC2:1;
    uint32_t :3;
    uint32_t CNIEC6:1;
    uint32_t CNIEC7:1;
    uint32_t CNIEC8:1;
    uint32_t CNIEC9:1;
    uint32_t CNIEC10:1;
    uint32_t CNIEC11:1;
    uint32_t CNIEC12:1;
    uint32_t CNIEC13:1;
    uint32_t CNIEC14:1;
    uint32_t CNIEC15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNENCbits_t;
extern volatile __CNENCbits_t CNENCbits __asm__ ("CNENC") __attribute__((section("sfrs"), address(0xBF860280)));
extern volatile uint32_t        CNENCCLR __attribute__((section("sfrs"),address(0xBF860284)));
extern volatile uint32_t        CNENCSET __attribute__((section("sfrs"),address(0xBF860288)));
extern volatile uint32_t        CNENCINV __attribute__((section("sfrs"),address(0xBF86028C)));
#define CNSTATC CNSTATC
extern volatile uint32_t   CNSTATC __attribute__((section("sfrs"), address(0xBF860290)));
typedef union {
  struct {
    uint32_t CNSTATC0:1;
    uint32_t CNSTATC1:1;
    uint32_t CNSTATC2:1;
    uint32_t :3;
    uint32_t CNSTATC6:1;
    uint32_t CNSTATC7:1;
    uint32_t CNSTATC8:1;
    uint32_t CNSTATC9:1;
    uint32_t CNSTATC10:1;
    uint32_t CNSTATC11:1;
    uint32_t CNSTATC12:1;
    uint32_t CNSTATC13:1;
    uint32_t CNSTATC14:1;
    uint32_t CNSTATC15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNSTATCbits_t;
extern volatile __CNSTATCbits_t CNSTATCbits __asm__ ("CNSTATC") __attribute__((section("sfrs"), address(0xBF860290)));
extern volatile uint32_t        CNSTATCCLR __attribute__((section("sfrs"),address(0xBF860294)));
extern volatile uint32_t        CNSTATCSET __attribute__((section("sfrs"),address(0xBF860298)));
extern volatile uint32_t        CNSTATCINV __attribute__((section("sfrs"),address(0xBF86029C)));
#define CNNEC CNNEC
extern volatile uint32_t   CNNEC __attribute__((section("sfrs"), address(0xBF8602A0)));
typedef struct {
  uint32_t CNNEC0:1;
  uint32_t CNNEC1:1;
  uint32_t CNNEC2:1;
  uint32_t :3;
  uint32_t CNNEC6:1;
  uint32_t CNNEC7:1;
  uint32_t CNNEC8:1;
  uint32_t CNNEC9:1;
  uint32_t CNNEC10:1;
  uint32_t CNNEC11:1;
  uint32_t CNNEC12:1;
  uint32_t CNNEC13:1;
  uint32_t CNNEC14:1;
  uint32_t CNNEC15:1;
} __CNNECbits_t;
extern volatile __CNNECbits_t CNNECbits __asm__ ("CNNEC") __attribute__((section("sfrs"), address(0xBF8602A0)));
extern volatile uint32_t        CNNECCLR __attribute__((section("sfrs"),address(0xBF8602A4)));
extern volatile uint32_t        CNNECSET __attribute__((section("sfrs"),address(0xBF8602A8)));
extern volatile uint32_t        CNNECINV __attribute__((section("sfrs"),address(0xBF8602AC)));
#define CNFC CNFC
extern volatile uint32_t   CNFC __attribute__((section("sfrs"), address(0xBF8602B0)));
typedef struct {
  uint32_t CNFC0:1;
  uint32_t CNFC1:1;
  uint32_t CNFC2:1;
  uint32_t :3;
  uint32_t CNFC6:1;
  uint32_t CNFC7:1;
  uint32_t CNFC8:1;
  uint32_t CNFC9:1;
  uint32_t CNFC10:1;
  uint32_t CNFC11:1;
  uint32_t CNFC12:1;
  uint32_t CNFC13:1;
  uint32_t CNFC14:1;
  uint32_t CNFC15:1;
} __CNFCbits_t;
extern volatile __CNFCbits_t CNFCbits __asm__ ("CNFC") __attribute__((section("sfrs"), address(0xBF8602B0)));
extern volatile uint32_t        CNFCCLR __attribute__((section("sfrs"),address(0xBF8602B4)));
extern volatile uint32_t        CNFCSET __attribute__((section("sfrs"),address(0xBF8602B8)));
extern volatile uint32_t        CNFCINV __attribute__((section("sfrs"),address(0xBF8602BC)));
#define SRCON0C SRCON0C
extern volatile uint32_t   SRCON0C __attribute__((section("sfrs"), address(0xBF8602C0)));
typedef struct {
  uint32_t :6;
  uint32_t SR0C6:1;
  uint32_t SR0C7:1;
  uint32_t SR0C8:1;
  uint32_t SR0C9:1;
  uint32_t :1;
  uint32_t SR0C11:1;
  uint32_t :3;
  uint32_t SR0C15:1;
} __SRCON0Cbits_t;
extern volatile __SRCON0Cbits_t SRCON0Cbits __asm__ ("SRCON0C") __attribute__((section("sfrs"), address(0xBF8602C0)));
extern volatile uint32_t        SRCON0CCLR __attribute__((section("sfrs"),address(0xBF8602C4)));
extern volatile uint32_t        SRCON0CSET __attribute__((section("sfrs"),address(0xBF8602C8)));
extern volatile uint32_t        SRCON0CINV __attribute__((section("sfrs"),address(0xBF8602CC)));
#define SRCON1C SRCON1C
extern volatile uint32_t   SRCON1C __attribute__((section("sfrs"), address(0xBF8602D0)));
typedef struct {
  uint32_t :6;
  uint32_t SR1C6:1;
  uint32_t SR1C7:1;
  uint32_t SR1C8:1;
  uint32_t SR1C9:1;
  uint32_t :1;
  uint32_t SR1C11:1;
  uint32_t :3;
  uint32_t SR1C15:1;
} __SRCON1Cbits_t;
extern volatile __SRCON1Cbits_t SRCON1Cbits __asm__ ("SRCON1C") __attribute__((section("sfrs"), address(0xBF8602D0)));
extern volatile uint32_t        SRCON1CCLR __attribute__((section("sfrs"),address(0xBF8602D4)));
extern volatile uint32_t        SRCON1CSET __attribute__((section("sfrs"),address(0xBF8602D8)));
extern volatile uint32_t        SRCON1CINV __attribute__((section("sfrs"),address(0xBF8602DC)));
#define TRISD TRISD
extern volatile uint32_t   TRISD __attribute__((section("sfrs"), address(0xBF860310)));
typedef union {
  struct {
    uint32_t :1;
    uint32_t TRISD1:1;
    uint32_t TRISD2:1;
    uint32_t TRISD3:1;
    uint32_t TRISD4:1;
    uint32_t TRISD5:1;
    uint32_t TRISD6:1;
    uint32_t :1;
    uint32_t TRISD8:1;
    uint32_t :3;
    uint32_t TRISD12:1;
    uint32_t TRISD13:1;
    uint32_t TRISD14:1;
    uint32_t TRISD15:1;
  };
  struct {
    uint32_t w:32;
  };
} __TRISDbits_t;
extern volatile __TRISDbits_t TRISDbits __asm__ ("TRISD") __attribute__((section("sfrs"), address(0xBF860310)));
extern volatile uint32_t        TRISDCLR __attribute__((section("sfrs"),address(0xBF860314)));
extern volatile uint32_t        TRISDSET __attribute__((section("sfrs"),address(0xBF860318)));
extern volatile uint32_t        TRISDINV __attribute__((section("sfrs"),address(0xBF86031C)));
#define PORTD PORTD
extern volatile uint32_t   PORTD __attribute__((section("sfrs"), address(0xBF860320)));
typedef union {
  struct {
    uint32_t :1;
    uint32_t RD1:1;
    uint32_t RD2:1;
    uint32_t RD3:1;
    uint32_t RD4:1;
    uint32_t RD5:1;
    uint32_t RD6:1;
    uint32_t :1;
    uint32_t RD8:1;
    uint32_t :3;
    uint32_t RD12:1;
    uint32_t RD13:1;
    uint32_t RD14:1;
    uint32_t RD15:1;
  };
  struct {
    uint32_t w:32;
  };
} __PORTDbits_t;
extern volatile __PORTDbits_t PORTDbits __asm__ ("PORTD") __attribute__((section("sfrs"), address(0xBF860320)));
extern volatile uint32_t        PORTDCLR __attribute__((section("sfrs"),address(0xBF860324)));
extern volatile uint32_t        PORTDSET __attribute__((section("sfrs"),address(0xBF860328)));
extern volatile uint32_t        PORTDINV __attribute__((section("sfrs"),address(0xBF86032C)));
#define LATD LATD
extern volatile uint32_t   LATD __attribute__((section("sfrs"), address(0xBF860330)));
typedef union {
  struct {
    uint32_t :1;
    uint32_t LATD1:1;
    uint32_t LATD2:1;
    uint32_t LATD3:1;
    uint32_t LATD4:1;
    uint32_t LATD5:1;
    uint32_t LATD6:1;
    uint32_t :1;
    uint32_t LATD8:1;
    uint32_t :3;
    uint32_t LATD12:1;
    uint32_t LATD13:1;
    uint32_t LATD14:1;
    uint32_t LATD15:1;
  };
  struct {
    uint32_t w:32;
  };
} __LATDbits_t;
extern volatile __LATDbits_t LATDbits __asm__ ("LATD") __attribute__((section("sfrs"), address(0xBF860330)));
extern volatile uint32_t        LATDCLR __attribute__((section("sfrs"),address(0xBF860334)));
extern volatile uint32_t        LATDSET __attribute__((section("sfrs"),address(0xBF860338)));
extern volatile uint32_t        LATDINV __attribute__((section("sfrs"),address(0xBF86033C)));
#define ODCD ODCD
extern volatile uint32_t   ODCD __attribute__((section("sfrs"), address(0xBF860340)));
typedef union {
  struct {
    uint32_t :1;
    uint32_t ODCD1:1;
    uint32_t ODCD2:1;
    uint32_t ODCD3:1;
    uint32_t ODCD4:1;
    uint32_t ODCD5:1;
    uint32_t ODCD6:1;
    uint32_t :1;
    uint32_t ODCD8:1;
    uint32_t :3;
    uint32_t ODCD12:1;
    uint32_t ODCD13:1;
    uint32_t ODCD14:1;
    uint32_t ODCD15:1;
  };
  struct {
    uint32_t w:32;
  };
} __ODCDbits_t;
extern volatile __ODCDbits_t ODCDbits __asm__ ("ODCD") __attribute__((section("sfrs"), address(0xBF860340)));
extern volatile uint32_t        ODCDCLR __attribute__((section("sfrs"),address(0xBF860344)));
extern volatile uint32_t        ODCDSET __attribute__((section("sfrs"),address(0xBF860348)));
extern volatile uint32_t        ODCDINV __attribute__((section("sfrs"),address(0xBF86034C)));
#define CNPUD CNPUD
extern volatile uint32_t   CNPUD __attribute__((section("sfrs"), address(0xBF860350)));
typedef union {
  struct {
    uint32_t :1;
    uint32_t CNPUD1:1;
    uint32_t CNPUD2:1;
    uint32_t CNPUD3:1;
    uint32_t CNPUD4:1;
    uint32_t CNPUD5:1;
    uint32_t CNPUD6:1;
    uint32_t :1;
    uint32_t CNPUD8:1;
    uint32_t :3;
    uint32_t CNPUD12:1;
    uint32_t CNPUD13:1;
    uint32_t CNPUD14:1;
    uint32_t CNPUD15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPUDbits_t;
extern volatile __CNPUDbits_t CNPUDbits __asm__ ("CNPUD") __attribute__((section("sfrs"), address(0xBF860350)));
extern volatile uint32_t        CNPUDCLR __attribute__((section("sfrs"),address(0xBF860354)));
extern volatile uint32_t        CNPUDSET __attribute__((section("sfrs"),address(0xBF860358)));
extern volatile uint32_t        CNPUDINV __attribute__((section("sfrs"),address(0xBF86035C)));
#define CNPDD CNPDD
extern volatile uint32_t   CNPDD __attribute__((section("sfrs"), address(0xBF860360)));
typedef union {
  struct {
    uint32_t :1;
    uint32_t CNPDD1:1;
    uint32_t CNPDD2:1;
    uint32_t CNPDD3:1;
    uint32_t CNPDD4:1;
    uint32_t CNPDD5:1;
    uint32_t CNPDD6:1;
    uint32_t :1;
    uint32_t CNPDD8:1;
    uint32_t :3;
    uint32_t CNPDD12:1;
    uint32_t CNPDD13:1;
    uint32_t CNPDD14:1;
    uint32_t CNPDD15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPDDbits_t;
extern volatile __CNPDDbits_t CNPDDbits __asm__ ("CNPDD") __attribute__((section("sfrs"), address(0xBF860360)));
extern volatile uint32_t        CNPDDCLR __attribute__((section("sfrs"),address(0xBF860364)));
extern volatile uint32_t        CNPDDSET __attribute__((section("sfrs"),address(0xBF860368)));
extern volatile uint32_t        CNPDDINV __attribute__((section("sfrs"),address(0xBF86036C)));
#define CNCOND CNCOND
extern volatile uint32_t   CNCOND __attribute__((section("sfrs"), address(0xBF860370)));
typedef union {
  struct {
    uint32_t :11;
    uint32_t EDGEDETECT:1;
    uint32_t :3;
    uint32_t ON:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNCONDbits_t;
extern volatile __CNCONDbits_t CNCONDbits __asm__ ("CNCOND") __attribute__((section("sfrs"), address(0xBF860370)));
extern volatile uint32_t        CNCONDCLR __attribute__((section("sfrs"),address(0xBF860374)));
extern volatile uint32_t        CNCONDSET __attribute__((section("sfrs"),address(0xBF860378)));
extern volatile uint32_t        CNCONDINV __attribute__((section("sfrs"),address(0xBF86037C)));
#define CNEND CNEND
extern volatile uint32_t   CNEND __attribute__((section("sfrs"), address(0xBF860380)));
typedef union {
  struct {
    uint32_t :1;
    uint32_t CNIED1:1;
    uint32_t CNIED2:1;
    uint32_t CNIED3:1;
    uint32_t CNIED4:1;
    uint32_t CNIED5:1;
    uint32_t CNIED6:1;
    uint32_t :1;
    uint32_t CNIED8:1;
    uint32_t :3;
    uint32_t CNIED12:1;
    uint32_t CNIED13:1;
    uint32_t CNIED14:1;
    uint32_t CNIED15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNENDbits_t;
