Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/include/proc/p32mk0512gpg064.h
extern volatile __PORTEbits_t PORTEbits __asm__ ("PORTE") __attribute__((section("sfrs"), address(0xBF860420)));
extern volatile uint32_t        PORTECLR __attribute__((section("sfrs"),address(0xBF860424)));
extern volatile uint32_t        PORTESET __attribute__((section("sfrs"),address(0xBF860428)));
extern volatile uint32_t        PORTEINV __attribute__((section("sfrs"),address(0xBF86042C)));
#define LATE LATE
extern volatile uint32_t   LATE __attribute__((section("sfrs"), address(0xBF860430)));
typedef union {
  struct {
    uint32_t LATE0:1;
    uint32_t LATE1:1;
    uint32_t :6;
    uint32_t LATE8:1;
    uint32_t LATE9:1;
    uint32_t :2;
    uint32_t LATE12:1;
    uint32_t LATE13:1;
    uint32_t LATE14:1;
    uint32_t LATE15:1;
  };
  struct {
    uint32_t w:32;
  };
} __LATEbits_t;
extern volatile __LATEbits_t LATEbits __asm__ ("LATE") __attribute__((section("sfrs"), address(0xBF860430)));
extern volatile uint32_t        LATECLR __attribute__((section("sfrs"),address(0xBF860434)));
extern volatile uint32_t        LATESET __attribute__((section("sfrs"),address(0xBF860438)));
extern volatile uint32_t        LATEINV __attribute__((section("sfrs"),address(0xBF86043C)));
#define ODCE ODCE
extern volatile uint32_t   ODCE __attribute__((section("sfrs"), address(0xBF860440)));
typedef union {
  struct {
    uint32_t ODCE0:1;
    uint32_t ODCE1:1;
    uint32_t :6;
    uint32_t ODCE8:1;
    uint32_t ODCE9:1;
    uint32_t :2;
    uint32_t ODCE12:1;
    uint32_t ODCE13:1;
    uint32_t ODCE14:1;
    uint32_t ODCE15:1;
  };
  struct {
    uint32_t w:32;
  };
} __ODCEbits_t;
extern volatile __ODCEbits_t ODCEbits __asm__ ("ODCE") __attribute__((section("sfrs"), address(0xBF860440)));
extern volatile uint32_t        ODCECLR __attribute__((section("sfrs"),address(0xBF860444)));
extern volatile uint32_t        ODCESET __attribute__((section("sfrs"),address(0xBF860448)));
extern volatile uint32_t        ODCEINV __attribute__((section("sfrs"),address(0xBF86044C)));
#define CNPUE CNPUE
extern volatile uint32_t   CNPUE __attribute__((section("sfrs"), address(0xBF860450)));
typedef union {
  struct {
    uint32_t CNPUE0:1;
    uint32_t CNPUE1:1;
    uint32_t :6;
    uint32_t CNPUE8:1;
    uint32_t CNPUE9:1;
    uint32_t :2;
    uint32_t CNPUE12:1;
    uint32_t CNPUE13:1;
    uint32_t CNPUE14:1;
    uint32_t CNPUE15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPUEbits_t;
extern volatile __CNPUEbits_t CNPUEbits __asm__ ("CNPUE") __attribute__((section("sfrs"), address(0xBF860450)));
extern volatile uint32_t        CNPUECLR __attribute__((section("sfrs"),address(0xBF860454)));
extern volatile uint32_t        CNPUESET __attribute__((section("sfrs"),address(0xBF860458)));
extern volatile uint32_t        CNPUEINV __attribute__((section("sfrs"),address(0xBF86045C)));
#define CNPDE CNPDE
extern volatile uint32_t   CNPDE __attribute__((section("sfrs"), address(0xBF860460)));
typedef union {
  struct {
    uint32_t CNPDE0:1;
    uint32_t CNPDE1:1;
    uint32_t :6;
    uint32_t CNPDE8:1;
    uint32_t CNPDE9:1;
    uint32_t :2;
    uint32_t CNPDE12:1;
    uint32_t CNPDE13:1;
    uint32_t CNPDE14:1;
    uint32_t CNPDE15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPDEbits_t;
extern volatile __CNPDEbits_t CNPDEbits __asm__ ("CNPDE") __attribute__((section("sfrs"), address(0xBF860460)));
extern volatile uint32_t        CNPDECLR __attribute__((section("sfrs"),address(0xBF860464)));
extern volatile uint32_t        CNPDESET __attribute__((section("sfrs"),address(0xBF860468)));
extern volatile uint32_t        CNPDEINV __attribute__((section("sfrs"),address(0xBF86046C)));
#define CNCONE CNCONE
extern volatile uint32_t   CNCONE __attribute__((section("sfrs"), address(0xBF860470)));
typedef union {
  struct {
    uint32_t :11;
    uint32_t EDGEDETECT:1;
    uint32_t :3;
    uint32_t ON:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNCONEbits_t;
extern volatile __CNCONEbits_t CNCONEbits __asm__ ("CNCONE") __attribute__((section("sfrs"), address(0xBF860470)));
extern volatile uint32_t        CNCONECLR __attribute__((section("sfrs"),address(0xBF860474)));
extern volatile uint32_t        CNCONESET __attribute__((section("sfrs"),address(0xBF860478)));
extern volatile uint32_t        CNCONEINV __attribute__((section("sfrs"),address(0xBF86047C)));
#define CNENE CNENE
extern volatile uint32_t   CNENE __attribute__((section("sfrs"), address(0xBF860480)));
typedef union {
  struct {
    uint32_t CNIEE0:1;
    uint32_t CNIEE1:1;
    uint32_t :6;
    uint32_t CNIEE8:1;
    uint32_t CNIEE9:1;
    uint32_t :2;
    uint32_t CNIEE12:1;
    uint32_t CNIEE13:1;
    uint32_t CNIEE14:1;
    uint32_t CNIEE15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNENEbits_t;
extern volatile __CNENEbits_t CNENEbits __asm__ ("CNENE") __attribute__((section("sfrs"), address(0xBF860480)));
extern volatile uint32_t        CNENECLR __attribute__((section("sfrs"),address(0xBF860484)));
extern volatile uint32_t        CNENESET __attribute__((section("sfrs"),address(0xBF860488)));
extern volatile uint32_t        CNENEINV __attribute__((section("sfrs"),address(0xBF86048C)));
#define CNSTATE CNSTATE
extern volatile uint32_t   CNSTATE __attribute__((section("sfrs"), address(0xBF860490)));
typedef union {
  struct {
    uint32_t CNSTATE0:1;
    uint32_t CNSTATE1:1;
    uint32_t :6;
    uint32_t CNSTATE8:1;
    uint32_t CNSTATE9:1;
    uint32_t :2;
    uint32_t CNSTATE12:1;
    uint32_t CNSTATE13:1;
    uint32_t CNSTATE14:1;
    uint32_t CNSTATE15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNSTATEbits_t;
extern volatile __CNSTATEbits_t CNSTATEbits __asm__ ("CNSTATE") __attribute__((section("sfrs"), address(0xBF860490)));
extern volatile uint32_t        CNSTATECLR __attribute__((section("sfrs"),address(0xBF860494)));
extern volatile uint32_t        CNSTATESET __attribute__((section("sfrs"),address(0xBF860498)));
extern volatile uint32_t        CNSTATEINV __attribute__((section("sfrs"),address(0xBF86049C)));
#define CNNEE CNNEE
extern volatile uint32_t   CNNEE __attribute__((section("sfrs"), address(0xBF8604A0)));
typedef struct {
  uint32_t CNNEE0:1;
  uint32_t CNNEE1:1;
  uint32_t :6;
  uint32_t CNNEE8:1;
  uint32_t CNNEE9:1;
  uint32_t :2;
  uint32_t CNNEE12:1;
  uint32_t CNNEE13:1;
  uint32_t CNNEE14:1;
  uint32_t CNNEE15:1;
} __CNNEEbits_t;
