Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/include/proc/p32mk0512gpg064.h
extern volatile __DSGPR9bits_t DSGPR9bits __asm__ ("DSGPR9") __attribute__((section("sfrs"), address(0xBF8C0230)));
#define DSGPR10 DSGPR10
extern volatile uint32_t   DSGPR10 __attribute__((section("sfrs"), address(0xBF8C0234)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR10bits_t;
extern volatile __DSGPR10bits_t DSGPR10bits __asm__ ("DSGPR10") __attribute__((section("sfrs"), address(0xBF8C0234)));
#define DSGPR11 DSGPR11
extern volatile uint32_t   DSGPR11 __attribute__((section("sfrs"), address(0xBF8C0238)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR11bits_t;
extern volatile __DSGPR11bits_t DSGPR11bits __asm__ ("DSGPR11") __attribute__((section("sfrs"), address(0xBF8C0238)));
#define DSGPR12 DSGPR12
extern volatile uint32_t   DSGPR12 __attribute__((section("sfrs"), address(0xBF8C023C)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR12bits_t;
extern volatile __DSGPR12bits_t DSGPR12bits __asm__ ("DSGPR12") __attribute__((section("sfrs"), address(0xBF8C023C)));
#define DSGPR13 DSGPR13
extern volatile uint32_t   DSGPR13 __attribute__((section("sfrs"), address(0xBF8C0240)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR13bits_t;
extern volatile __DSGPR13bits_t DSGPR13bits __asm__ ("DSGPR13") __attribute__((section("sfrs"), address(0xBF8C0240)));
#define DSGPR14 DSGPR14
extern volatile uint32_t   DSGPR14 __attribute__((section("sfrs"), address(0xBF8C0244)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR14bits_t;
extern volatile __DSGPR14bits_t DSGPR14bits __asm__ ("DSGPR14") __attribute__((section("sfrs"), address(0xBF8C0244)));
#define DSGPR15 DSGPR15
extern volatile uint32_t   DSGPR15 __attribute__((section("sfrs"), address(0xBF8C0248)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR15bits_t;
extern volatile __DSGPR15bits_t DSGPR15bits __asm__ ("DSGPR15") __attribute__((section("sfrs"), address(0xBF8C0248)));
#define DSGPR16 DSGPR16
extern volatile uint32_t   DSGPR16 __attribute__((section("sfrs"), address(0xBF8C024C)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR16bits_t;
extern volatile __DSGPR16bits_t DSGPR16bits __asm__ ("DSGPR16") __attribute__((section("sfrs"), address(0xBF8C024C)));
#define DSGPR17 DSGPR17
extern volatile uint32_t   DSGPR17 __attribute__((section("sfrs"), address(0xBF8C0250)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR17bits_t;
extern volatile __DSGPR17bits_t DSGPR17bits __asm__ ("DSGPR17") __attribute__((section("sfrs"), address(0xBF8C0250)));
#define DSGPR18 DSGPR18
extern volatile uint32_t   DSGPR18 __attribute__((section("sfrs"), address(0xBF8C0254)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR18bits_t;
extern volatile __DSGPR18bits_t DSGPR18bits __asm__ ("DSGPR18") __attribute__((section("sfrs"), address(0xBF8C0254)));
#define DSGPR19 DSGPR19
extern volatile uint32_t   DSGPR19 __attribute__((section("sfrs"), address(0xBF8C0258)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR19bits_t;
extern volatile __DSGPR19bits_t DSGPR19bits __asm__ ("DSGPR19") __attribute__((section("sfrs"), address(0xBF8C0258)));
#define DSGPR20 DSGPR20
extern volatile uint32_t   DSGPR20 __attribute__((section("sfrs"), address(0xBF8C025C)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR20bits_t;
extern volatile __DSGPR20bits_t DSGPR20bits __asm__ ("DSGPR20") __attribute__((section("sfrs"), address(0xBF8C025C)));
#define DSGPR21 DSGPR21
extern volatile uint32_t   DSGPR21 __attribute__((section("sfrs"), address(0xBF8C0260)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR21bits_t;
extern volatile __DSGPR21bits_t DSGPR21bits __asm__ ("DSGPR21") __attribute__((section("sfrs"), address(0xBF8C0260)));
#define DSGPR22 DSGPR22
extern volatile uint32_t   DSGPR22 __attribute__((section("sfrs"), address(0xBF8C0264)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR22bits_t;
extern volatile __DSGPR22bits_t DSGPR22bits __asm__ ("DSGPR22") __attribute__((section("sfrs"), address(0xBF8C0264)));
#define DSGPR23 DSGPR23
extern volatile uint32_t   DSGPR23 __attribute__((section("sfrs"), address(0xBF8C0268)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR23bits_t;
extern volatile __DSGPR23bits_t DSGPR23bits __asm__ ("DSGPR23") __attribute__((section("sfrs"), address(0xBF8C0268)));
#define DSGPR24 DSGPR24
extern volatile uint32_t   DSGPR24 __attribute__((section("sfrs"), address(0xBF8C026C)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR24bits_t;
extern volatile __DSGPR24bits_t DSGPR24bits __asm__ ("DSGPR24") __attribute__((section("sfrs"), address(0xBF8C026C)));
#define DSGPR25 DSGPR25
extern volatile uint32_t   DSGPR25 __attribute__((section("sfrs"), address(0xBF8C0270)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR25bits_t;
extern volatile __DSGPR25bits_t DSGPR25bits __asm__ ("DSGPR25") __attribute__((section("sfrs"), address(0xBF8C0270)));
#define DSGPR26 DSGPR26
extern volatile uint32_t   DSGPR26 __attribute__((section("sfrs"), address(0xBF8C0274)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR26bits_t;
extern volatile __DSGPR26bits_t DSGPR26bits __asm__ ("DSGPR26") __attribute__((section("sfrs"), address(0xBF8C0274)));
#define DSGPR27 DSGPR27
extern volatile uint32_t   DSGPR27 __attribute__((section("sfrs"), address(0xBF8C0278)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR27bits_t;
extern volatile __DSGPR27bits_t DSGPR27bits __asm__ ("DSGPR27") __attribute__((section("sfrs"), address(0xBF8C0278)));
#define DSGPR28 DSGPR28
extern volatile uint32_t   DSGPR28 __attribute__((section("sfrs"), address(0xBF8C027C)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR28bits_t;
extern volatile __DSGPR28bits_t DSGPR28bits __asm__ ("DSGPR28") __attribute__((section("sfrs"), address(0xBF8C027C)));
#define DSGPR29 DSGPR29
extern volatile uint32_t   DSGPR29 __attribute__((section("sfrs"), address(0xBF8C0280)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR29bits_t;
extern volatile __DSGPR29bits_t DSGPR29bits __asm__ ("DSGPR29") __attribute__((section("sfrs"), address(0xBF8C0280)));
#define DSGPR30 DSGPR30
extern volatile uint32_t   DSGPR30 __attribute__((section("sfrs"), address(0xBF8C0284)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR30bits_t;
extern volatile __DSGPR30bits_t DSGPR30bits __asm__ ("DSGPR30") __attribute__((section("sfrs"), address(0xBF8C0284)));
#define DSGPR31 DSGPR31
extern volatile uint32_t   DSGPR31 __attribute__((section("sfrs"), address(0xBF8C0288)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR31bits_t;
extern volatile __DSGPR31bits_t DSGPR31bits __asm__ ("DSGPR31") __attribute__((section("sfrs"), address(0xBF8C0288)));
#define DSGPR32 DSGPR32
extern volatile uint32_t   DSGPR32 __attribute__((section("sfrs"), address(0xBF8C028C)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR32bits_t;
