Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/include/proc/p32mk0512gpg064.h
#define _OSCCON_CF_POSITION                      0x00000003
#define _OSCCON_CF_MASK                          0x00000008
#define _OSCCON_CF_LENGTH                        0x00000001

#define _OSCCON_SLPEN_POSITION                   0x00000004
#define _OSCCON_SLPEN_MASK                       0x00000010
#define _OSCCON_SLPEN_LENGTH                     0x00000001

#define _OSCCON_CLKLOCK_POSITION                 0x00000007
#define _OSCCON_CLKLOCK_MASK                     0x00000080
#define _OSCCON_CLKLOCK_LENGTH                   0x00000001

#define _OSCCON_NOSC_POSITION                    0x00000008
#define _OSCCON_NOSC_MASK                        0x00000700
#define _OSCCON_NOSC_LENGTH                      0x00000003

#define _OSCCON_COSC_POSITION                    0x0000000C
#define _OSCCON_COSC_MASK                        0x00007000
#define _OSCCON_COSC_LENGTH                      0x00000003

#define _OSCCON_SLP2SPD_POSITION                 0x00000015
#define _OSCCON_SLP2SPD_MASK                     0x00200000
#define _OSCCON_SLP2SPD_LENGTH                   0x00000001

#define _OSCCON_DRMEN_POSITION                   0x00000017
#define _OSCCON_DRMEN_MASK                       0x00800000
#define _OSCCON_DRMEN_LENGTH                     0x00000001

#define _OSCCON_FRCDIV_POSITION                  0x00000018
#define _OSCCON_FRCDIV_MASK                      0x07000000
#define _OSCCON_FRCDIV_LENGTH                    0x00000003

#define _OSCTUN_TUN_POSITION                     0x00000000
#define _OSCTUN_TUN_MASK                         0x0000003F
#define _OSCTUN_TUN_LENGTH                       0x00000006

#define _SPLLCON_PLLRANGE_POSITION               0x00000000
#define _SPLLCON_PLLRANGE_MASK                   0x00000007
#define _SPLLCON_PLLRANGE_LENGTH                 0x00000003

#define _SPLLCON_PLLICLK_POSITION                0x00000007
#define _SPLLCON_PLLICLK_MASK                    0x00000080
#define _SPLLCON_PLLICLK_LENGTH                  0x00000001

#define _SPLLCON_PLLIDIV_POSITION                0x00000008
#define _SPLLCON_PLLIDIV_MASK                    0x00000700
#define _SPLLCON_PLLIDIV_LENGTH                  0x00000003

#define _SPLLCON_PLLMULT_POSITION                0x00000010
#define _SPLLCON_PLLMULT_MASK                    0x007F0000
#define _SPLLCON_PLLMULT_LENGTH                  0x00000007

#define _SPLLCON_PLLODIV_POSITION                0x00000018
#define _SPLLCON_PLLODIV_MASK                    0x07000000
#define _SPLLCON_PLLODIV_LENGTH                  0x00000003

#define _UPLLCON_PLLRANGE_POSITION               0x00000000
#define _UPLLCON_PLLRANGE_MASK                   0x00000007
#define _UPLLCON_PLLRANGE_LENGTH                 0x00000003

#define _UPLLCON_PLLIDIV_POSITION                0x00000008
#define _UPLLCON_PLLIDIV_MASK                    0x00000700
#define _UPLLCON_PLLIDIV_LENGTH                  0x00000003

#define _UPLLCON_PLLMULT_POSITION                0x00000010
#define _UPLLCON_PLLMULT_MASK                    0x007F0000
#define _UPLLCON_PLLMULT_LENGTH                  0x00000007

#define _UPLLCON_PLLODIV_POSITION                0x00000018
#define _UPLLCON_PLLODIV_MASK                    0x07000000
#define _UPLLCON_PLLODIV_LENGTH                  0x00000003

#define _UPLLCON_UPOSCEN_POSITION                0x0000001D
#define _UPLLCON_UPOSCEN_MASK                    0x20000000
#define _UPLLCON_UPOSCEN_LENGTH                  0x00000001

#define _RCON_POR_POSITION                       0x00000000
#define _RCON_POR_MASK                           0x00000001
#define _RCON_POR_LENGTH                         0x00000001

#define _RCON_BOR_POSITION                       0x00000001
#define _RCON_BOR_MASK                           0x00000002
#define _RCON_BOR_LENGTH                         0x00000001

#define _RCON_IDLE_POSITION                      0x00000002
#define _RCON_IDLE_MASK                          0x00000004
#define _RCON_IDLE_LENGTH                        0x00000001

#define _RCON_SLEEP_POSITION                     0x00000003
#define _RCON_SLEEP_MASK                         0x00000008
#define _RCON_SLEEP_LENGTH                       0x00000001

#define _RCON_WDTO_POSITION                      0x00000004
#define _RCON_WDTO_MASK                          0x00000010
#define _RCON_WDTO_LENGTH                        0x00000001

#define _RCON_DMTO_POSITION                      0x00000005
#define _RCON_DMTO_MASK                          0x00000020
#define _RCON_DMTO_LENGTH                        0x00000001

#define _RCON_SWR_POSITION                       0x00000006
#define _RCON_SWR_MASK                           0x00000040
#define _RCON_SWR_LENGTH                         0x00000001

#define _RCON_EXTR_POSITION                      0x00000007
#define _RCON_EXTR_MASK                          0x00000080
#define _RCON_EXTR_LENGTH                        0x00000001

#define _RCON_CMR_POSITION                       0x00000009
#define _RCON_CMR_MASK                           0x00000200
#define _RCON_CMR_LENGTH                         0x00000001

#define _RCON_DPSLP_POSITION                     0x0000000A
#define _RCON_DPSLP_MASK                         0x00000400
#define _RCON_DPSLP_LENGTH                       0x00000001

#define _RCON_VBAT_POSITION                      0x00000010
#define _RCON_VBAT_MASK                          0x00010000
#define _RCON_VBAT_LENGTH                        0x00000001

#define _RCON_VBPOR_POSITION                     0x00000011
#define _RCON_VBPOR_MASK                         0x00020000
#define _RCON_VBPOR_LENGTH                       0x00000001

#define _RCON_BCFGFAIL_POSITION                  0x0000001A
#define _RCON_BCFGFAIL_MASK                      0x04000000
#define _RCON_BCFGFAIL_LENGTH                    0x00000001

#define _RCON_BCFGERR_POSITION                   0x0000001B
#define _RCON_BCFGERR_MASK                       0x08000000
#define _RCON_BCFGERR_LENGTH                     0x00000001

#define _RCON_PORCORE_POSITION                   0x0000001E
#define _RCON_PORCORE_MASK                       0x40000000
#define _RCON_PORCORE_LENGTH                     0x00000001

#define _RCON_PORIO_POSITION                     0x0000001F
#define _RCON_PORIO_MASK                         0x80000000
#define _RCON_PORIO_LENGTH                       0x00000001

#define _RSWRST_SWRST_POSITION                   0x00000000
#define _RSWRST_SWRST_MASK                       0x00000001
#define _RSWRST_SWRST_LENGTH                     0x00000001

#define _RNMICON_NMICNT_POSITION                 0x00000000
#define _RNMICON_NMICNT_MASK                     0x0000FFFF
#define _RNMICON_NMICNT_LENGTH                   0x00000010

