Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/include/proc/p32mk0512gpg064.h
#define _IPC23_w_POSITION                        0x00000000
#define _IPC23_w_MASK                            0xFFFFFFFF
#define _IPC23_w_LENGTH                          0x00000020

#define _IPC24_AD1DF1IS_POSITION                 0x00000000
#define _IPC24_AD1DF1IS_MASK                     0x00000003
#define _IPC24_AD1DF1IS_LENGTH                   0x00000002

#define _IPC24_AD1DF1IP_POSITION                 0x00000002
#define _IPC24_AD1DF1IP_MASK                     0x0000001C
#define _IPC24_AD1DF1IP_LENGTH                   0x00000003

#define _IPC24_AD1DF2IS_POSITION                 0x00000008
#define _IPC24_AD1DF2IS_MASK                     0x00000300
#define _IPC24_AD1DF2IS_LENGTH                   0x00000002

#define _IPC24_AD1DF2IP_POSITION                 0x0000000A
#define _IPC24_AD1DF2IP_MASK                     0x00001C00
#define _IPC24_AD1DF2IP_LENGTH                   0x00000003

#define _IPC24_AD1DF3IS_POSITION                 0x00000010
#define _IPC24_AD1DF3IS_MASK                     0x00030000
#define _IPC24_AD1DF3IS_LENGTH                   0x00000002

#define _IPC24_AD1DF3IP_POSITION                 0x00000012
#define _IPC24_AD1DF3IP_MASK                     0x001C0000
#define _IPC24_AD1DF3IP_LENGTH                   0x00000003

#define _IPC24_AD1DF4IS_POSITION                 0x00000018
#define _IPC24_AD1DF4IS_MASK                     0x03000000
#define _IPC24_AD1DF4IS_LENGTH                   0x00000002

#define _IPC24_AD1DF4IP_POSITION                 0x0000001A
#define _IPC24_AD1DF4IP_MASK                     0x1C000000
#define _IPC24_AD1DF4IP_LENGTH                   0x00000003

#define _IPC24_w_POSITION                        0x00000000
#define _IPC24_w_MASK                            0xFFFFFFFF
#define _IPC24_w_LENGTH                          0x00000020

#define _IPC25_AD1F1IS_POSITION                  0x00000000
#define _IPC25_AD1F1IS_MASK                      0x00000003
#define _IPC25_AD1F1IS_LENGTH                    0x00000002

#define _IPC25_AD1F1IP_POSITION                  0x00000002
#define _IPC25_AD1F1IP_MASK                      0x0000001C
#define _IPC25_AD1F1IP_LENGTH                    0x00000003

#define _IPC25_AD1EOSIS_POSITION                 0x00000008
#define _IPC25_AD1EOSIS_MASK                     0x00000300
#define _IPC25_AD1EOSIS_LENGTH                   0x00000002

#define _IPC25_AD1EOSIP_POSITION                 0x0000000A
#define _IPC25_AD1EOSIP_MASK                     0x00001C00
#define _IPC25_AD1EOSIP_LENGTH                   0x00000003

#define _IPC25_AD1ARIS_POSITION                  0x00000010
#define _IPC25_AD1ARIS_MASK                      0x00030000
#define _IPC25_AD1ARIS_LENGTH                    0x00000002

#define _IPC25_AD1ARIP_POSITION                  0x00000012
#define _IPC25_AD1ARIP_MASK                      0x001C0000
#define _IPC25_AD1ARIP_LENGTH                    0x00000003

#define _IPC25_AD1RSIS_POSITION                  0x00000018
#define _IPC25_AD1RSIS_MASK                      0x03000000
#define _IPC25_AD1RSIS_LENGTH                    0x00000002

#define _IPC25_AD1RSIP_POSITION                  0x0000001A
#define _IPC25_AD1RSIP_MASK                      0x1C000000
#define _IPC25_AD1RSIP_LENGTH                    0x00000003

#define _IPC25_w_POSITION                        0x00000000
#define _IPC25_w_MASK                            0xFFFFFFFF
#define _IPC25_w_LENGTH                          0x00000020

#define _IPC26_AD1FCBTIS_POSITION                0x00000000
#define _IPC26_AD1FCBTIS_MASK                    0x00000003
#define _IPC26_AD1FCBTIS_LENGTH                  0x00000002

#define _IPC26_AD1FCBTIP_POSITION                0x00000002
#define _IPC26_AD1FCBTIP_MASK                    0x0000001C
#define _IPC26_AD1FCBTIP_LENGTH                  0x00000003

#define _IPC26_AD1G1IS_POSITION                  0x00000008
#define _IPC26_AD1G1IS_MASK                      0x00000300
#define _IPC26_AD1G1IS_LENGTH                    0x00000002

#define _IPC26_AD1G1IP_POSITION                  0x0000000A
#define _IPC26_AD1G1IP_MASK                      0x00001C00
#define _IPC26_AD1G1IP_LENGTH                    0x00000003

#define _IPC26_AD1D0IS_POSITION                  0x00000010
#define _IPC26_AD1D0IS_MASK                      0x00030000
#define _IPC26_AD1D0IS_LENGTH                    0x00000002

#define _IPC26_AD1D0IP_POSITION                  0x00000012
#define _IPC26_AD1D0IP_MASK                      0x001C0000
#define _IPC26_AD1D0IP_LENGTH                    0x00000003

#define _IPC26_AD1D1IS_POSITION                  0x00000018
#define _IPC26_AD1D1IS_MASK                      0x03000000
#define _IPC26_AD1D1IS_LENGTH                    0x00000002

#define _IPC26_AD1D1IP_POSITION                  0x0000001A
#define _IPC26_AD1D1IP_MASK                      0x1C000000
#define _IPC26_AD1D1IP_LENGTH                    0x00000003

#define _IPC26_w_POSITION                        0x00000000
#define _IPC26_w_MASK                            0xFFFFFFFF
#define _IPC26_w_LENGTH                          0x00000020

#define _IPC27_AD1D2IS_POSITION                  0x00000000
#define _IPC27_AD1D2IS_MASK                      0x00000003
#define _IPC27_AD1D2IS_LENGTH                    0x00000002

#define _IPC27_AD1D2IP_POSITION                  0x00000002
#define _IPC27_AD1D2IP_MASK                      0x0000001C
#define _IPC27_AD1D2IP_LENGTH                    0x00000003

#define _IPC27_AD1D3IS_POSITION                  0x00000008
#define _IPC27_AD1D3IS_MASK                      0x00000300
#define _IPC27_AD1D3IS_LENGTH                    0x00000002

#define _IPC27_AD1D3IP_POSITION                  0x0000000A
#define _IPC27_AD1D3IP_MASK                      0x00001C00
#define _IPC27_AD1D3IP_LENGTH                    0x00000003

#define _IPC27_AD1D4IS_POSITION                  0x00000010
#define _IPC27_AD1D4IS_MASK                      0x00030000
#define _IPC27_AD1D4IS_LENGTH                    0x00000002

#define _IPC27_AD1D4IP_POSITION                  0x00000012
#define _IPC27_AD1D4IP_MASK                      0x001C0000
#define _IPC27_AD1D4IP_LENGTH                    0x00000003

#define _IPC27_AD1D5IS_POSITION                  0x00000018
#define _IPC27_AD1D5IS_MASK                      0x03000000
#define _IPC27_AD1D5IS_LENGTH                    0x00000002

#define _IPC27_AD1D5IP_POSITION                  0x0000001A
#define _IPC27_AD1D5IP_MASK                      0x1C000000
#define _IPC27_AD1D5IP_LENGTH                    0x00000003

#define _IPC27_w_POSITION                        0x00000000
#define _IPC27_w_MASK                            0xFFFFFFFF
#define _IPC27_w_LENGTH                          0x00000020

