Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/include/proc/p32mk0512gpg064.h
#define _CM5CON_CFLTREN_POSITION                 0x00000013
#define _CM5CON_CFLTREN_MASK                     0x00080000
#define _CM5CON_CFLTREN_LENGTH                   0x00000001

#define _CM5CON_CFSEL_POSITION                   0x00000014
#define _CM5CON_CFSEL_MASK                       0x00700000
#define _CM5CON_CFSEL_LENGTH                     0x00000003

#define _CM5CON_HYSSEL_POSITION                  0x00000018
#define _CM5CON_HYSSEL_MASK                      0x03000000
#define _CM5CON_HYSSEL_LENGTH                    0x00000002

#define _CM5CON_HYSPOL_POSITION                  0x0000001C
#define _CM5CON_HYSPOL_MASK                      0x10000000
#define _CM5CON_HYSPOL_LENGTH                    0x00000001

#define _CM5CON_ENPGA_POSITION                   0x0000001E
#define _CM5CON_ENPGA_MASK                       0x40000000
#define _CM5CON_ENPGA_LENGTH                     0x00000001

#define _CM5CON_OPAON_POSITION                   0x0000001F
#define _CM5CON_OPAON_MASK                       0x80000000
#define _CM5CON_OPAON_LENGTH                     0x00000001

#define _CM5MSKCON_AANEN_POSITION                0x00000000
#define _CM5MSKCON_AANEN_MASK                    0x00000001
#define _CM5MSKCON_AANEN_LENGTH                  0x00000001

#define _CM5MSKCON_AAEN_POSITION                 0x00000001
#define _CM5MSKCON_AAEN_MASK                     0x00000002
#define _CM5MSKCON_AAEN_LENGTH                   0x00000001

#define _CM5MSKCON_ABNEN_POSITION                0x00000002
#define _CM5MSKCON_ABNEN_MASK                    0x00000004
#define _CM5MSKCON_ABNEN_LENGTH                  0x00000001

#define _CM5MSKCON_ABEN_POSITION                 0x00000003
#define _CM5MSKCON_ABEN_MASK                     0x00000008
#define _CM5MSKCON_ABEN_LENGTH                   0x00000001

#define _CM5MSKCON_ACNEN_POSITION                0x00000004
#define _CM5MSKCON_ACNEN_MASK                    0x00000010
#define _CM5MSKCON_ACNEN_LENGTH                  0x00000001

#define _CM5MSKCON_ACEN_POSITION                 0x00000005
#define _CM5MSKCON_ACEN_MASK                     0x00000020
#define _CM5MSKCON_ACEN_LENGTH                   0x00000001

#define _CM5MSKCON_PAGS_POSITION                 0x00000006
#define _CM5MSKCON_PAGS_MASK                     0x00000040
#define _CM5MSKCON_PAGS_LENGTH                   0x00000001

#define _CM5MSKCON_NAGS_POSITION                 0x00000007
#define _CM5MSKCON_NAGS_MASK                     0x00000080
#define _CM5MSKCON_NAGS_LENGTH                   0x00000001

#define _CM5MSKCON_OANEN_POSITION                0x00000008
#define _CM5MSKCON_OANEN_MASK                    0x00000100
#define _CM5MSKCON_OANEN_LENGTH                  0x00000001

#define _CM5MSKCON_OAEN_POSITION                 0x00000009
#define _CM5MSKCON_OAEN_MASK                     0x00000200
#define _CM5MSKCON_OAEN_LENGTH                   0x00000001

#define _CM5MSKCON_OBNEN_POSITION                0x0000000A
#define _CM5MSKCON_OBNEN_MASK                    0x00000400
#define _CM5MSKCON_OBNEN_LENGTH                  0x00000001

#define _CM5MSKCON_OBEN_POSITION                 0x0000000B
#define _CM5MSKCON_OBEN_MASK                     0x00000800
#define _CM5MSKCON_OBEN_LENGTH                   0x00000001

#define _CM5MSKCON_OCNEN_POSITION                0x0000000C
#define _CM5MSKCON_OCNEN_MASK                    0x00001000
#define _CM5MSKCON_OCNEN_LENGTH                  0x00000001

#define _CM5MSKCON_OCEN_POSITION                 0x0000000D
#define _CM5MSKCON_OCEN_MASK                     0x00002000
#define _CM5MSKCON_OCEN_LENGTH                   0x00000001

#define _CM5MSKCON_HLMS_POSITION                 0x0000000F
#define _CM5MSKCON_HLMS_MASK                     0x00008000
#define _CM5MSKCON_HLMS_LENGTH                   0x00000001

#define _CM5MSKCON_SELSRCA_POSITION              0x00000010
#define _CM5MSKCON_SELSRCA_MASK                  0x000F0000
#define _CM5MSKCON_SELSRCA_LENGTH                0x00000004

#define _CM5MSKCON_SELSRCB_POSITION              0x00000014
#define _CM5MSKCON_SELSRCB_MASK                  0x00F00000
#define _CM5MSKCON_SELSRCB_LENGTH                0x00000004

#define _CM5MSKCON_SELSRCC_POSITION              0x00000018
#define _CM5MSKCON_SELSRCC_MASK                  0x0F000000
#define _CM5MSKCON_SELSRCC_LENGTH                0x00000004

#define _DAC1CON_REFSEL_POSITION                 0x00000000
#define _DAC1CON_REFSEL_MASK                     0x00000003
#define _DAC1CON_REFSEL_LENGTH                   0x00000002

#define _DAC1CON_DACOE_POSITION                  0x00000008
#define _DAC1CON_DACOE_MASK                      0x00000100
#define _DAC1CON_DACOE_LENGTH                    0x00000001

#define _DAC1CON_ON_POSITION                     0x0000000F
#define _DAC1CON_ON_MASK                         0x00008000
#define _DAC1CON_ON_LENGTH                       0x00000001

#define _DAC1CON_DACDAT_POSITION                 0x00000010
#define _DAC1CON_DACDAT_MASK                     0xFFFF0000
#define _DAC1CON_DACDAT_LENGTH                   0x00000010

#define _DAC2CON_REFSEL_POSITION                 0x00000000
#define _DAC2CON_REFSEL_MASK                     0x00000003
#define _DAC2CON_REFSEL_LENGTH                   0x00000002

#define _DAC2CON_DACOE_POSITION                  0x00000008
#define _DAC2CON_DACOE_MASK                      0x00000100
#define _DAC2CON_DACOE_LENGTH                    0x00000001

#define _DAC2CON_ON_POSITION                     0x0000000F
#define _DAC2CON_ON_MASK                         0x00008000
#define _DAC2CON_ON_LENGTH                       0x00000001

#define _DAC2CON_DACDAT_POSITION                 0x00000010
#define _DAC2CON_DACDAT_MASK                     0xFFFF0000
#define _DAC2CON_DACDAT_LENGTH                   0x00000010

#define _CTMUCON_IRNG_POSITION                   0x00000000
#define _CTMUCON_IRNG_MASK                       0x00000003
#define _CTMUCON_IRNG_LENGTH                     0x00000002

#define _CTMUCON_ITRIM_POSITION                  0x00000002
#define _CTMUCON_ITRIM_MASK                      0x000000FC
#define _CTMUCON_ITRIM_LENGTH                    0x00000006

#define _CTMUCON_CTTRIG_POSITION                 0x00000008
#define _CTMUCON_CTTRIG_MASK                     0x00000100
#define _CTMUCON_CTTRIG_LENGTH                   0x00000001

#define _CTMUCON_IDISSEN_POSITION                0x00000009
#define _CTMUCON_IDISSEN_MASK                    0x00000200
#define _CTMUCON_IDISSEN_LENGTH                  0x00000001

#define _CTMUCON_EDGSEQEN_POSITION               0x0000000A
#define _CTMUCON_EDGSEQEN_MASK                   0x00000400
#define _CTMUCON_EDGSEQEN_LENGTH                 0x00000001

