Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/include/proc/p32mk0512gpg064.h
#define _CNPUF_CNPUF13_POSITION                  0x0000000D
#define _CNPUF_CNPUF13_MASK                      0x00002000
#define _CNPUF_CNPUF13_LENGTH                    0x00000001

#define _CNPUF_w_POSITION                        0x00000000
#define _CNPUF_w_MASK                            0xFFFFFFFF
#define _CNPUF_w_LENGTH                          0x00000020

#define _CNPDF_CNPDF0_POSITION                   0x00000000
#define _CNPDF_CNPDF0_MASK                       0x00000001
#define _CNPDF_CNPDF0_LENGTH                     0x00000001

#define _CNPDF_CNPDF1_POSITION                   0x00000001
#define _CNPDF_CNPDF1_MASK                       0x00000002
#define _CNPDF_CNPDF1_LENGTH                     0x00000001

#define _CNPDF_CNPDF5_POSITION                   0x00000005
#define _CNPDF_CNPDF5_MASK                       0x00000020
#define _CNPDF_CNPDF5_LENGTH                     0x00000001

#define _CNPDF_CNPDF6_POSITION                   0x00000006
#define _CNPDF_CNPDF6_MASK                       0x00000040
#define _CNPDF_CNPDF6_LENGTH                     0x00000001

#define _CNPDF_CNPDF7_POSITION                   0x00000007
#define _CNPDF_CNPDF7_MASK                       0x00000080
#define _CNPDF_CNPDF7_LENGTH                     0x00000001

#define _CNPDF_CNPDF9_POSITION                   0x00000009
#define _CNPDF_CNPDF9_MASK                       0x00000200
#define _CNPDF_CNPDF9_LENGTH                     0x00000001

#define _CNPDF_CNPDF10_POSITION                  0x0000000A
#define _CNPDF_CNPDF10_MASK                      0x00000400
#define _CNPDF_CNPDF10_LENGTH                    0x00000001

#define _CNPDF_CNPDF12_POSITION                  0x0000000C
#define _CNPDF_CNPDF12_MASK                      0x00001000
#define _CNPDF_CNPDF12_LENGTH                    0x00000001

#define _CNPDF_CNPDF13_POSITION                  0x0000000D
#define _CNPDF_CNPDF13_MASK                      0x00002000
#define _CNPDF_CNPDF13_LENGTH                    0x00000001

#define _CNPDF_w_POSITION                        0x00000000
#define _CNPDF_w_MASK                            0xFFFFFFFF
#define _CNPDF_w_LENGTH                          0x00000020

#define _CNCONF_EDGEDETECT_POSITION              0x0000000B
#define _CNCONF_EDGEDETECT_MASK                  0x00000800
#define _CNCONF_EDGEDETECT_LENGTH                0x00000001

#define _CNCONF_ON_POSITION                      0x0000000F
#define _CNCONF_ON_MASK                          0x00008000
#define _CNCONF_ON_LENGTH                        0x00000001

#define _CNCONF_w_POSITION                       0x00000000
#define _CNCONF_w_MASK                           0xFFFFFFFF
#define _CNCONF_w_LENGTH                         0x00000020

#define _CNENF_CNIEF0_POSITION                   0x00000000
#define _CNENF_CNIEF0_MASK                       0x00000001
#define _CNENF_CNIEF0_LENGTH                     0x00000001

#define _CNENF_CNIEF1_POSITION                   0x00000001
#define _CNENF_CNIEF1_MASK                       0x00000002
#define _CNENF_CNIEF1_LENGTH                     0x00000001

#define _CNENF_CNIEF5_POSITION                   0x00000005
#define _CNENF_CNIEF5_MASK                       0x00000020
#define _CNENF_CNIEF5_LENGTH                     0x00000001

#define _CNENF_CNIEF6_POSITION                   0x00000006
#define _CNENF_CNIEF6_MASK                       0x00000040
#define _CNENF_CNIEF6_LENGTH                     0x00000001

#define _CNENF_CNIEF7_POSITION                   0x00000007
#define _CNENF_CNIEF7_MASK                       0x00000080
#define _CNENF_CNIEF7_LENGTH                     0x00000001

#define _CNENF_CNIEF9_POSITION                   0x00000009
#define _CNENF_CNIEF9_MASK                       0x00000200
#define _CNENF_CNIEF9_LENGTH                     0x00000001

#define _CNENF_CNIEF10_POSITION                  0x0000000A
#define _CNENF_CNIEF10_MASK                      0x00000400
#define _CNENF_CNIEF10_LENGTH                    0x00000001

#define _CNENF_CNIEF12_POSITION                  0x0000000C
#define _CNENF_CNIEF12_MASK                      0x00001000
#define _CNENF_CNIEF12_LENGTH                    0x00000001

#define _CNENF_CNIEF13_POSITION                  0x0000000D
#define _CNENF_CNIEF13_MASK                      0x00002000
#define _CNENF_CNIEF13_LENGTH                    0x00000001

#define _CNENF_w_POSITION                        0x00000000
#define _CNENF_w_MASK                            0xFFFFFFFF
#define _CNENF_w_LENGTH                          0x00000020

#define _CNSTATF_CNSTATF0_POSITION               0x00000000
#define _CNSTATF_CNSTATF0_MASK                   0x00000001
#define _CNSTATF_CNSTATF0_LENGTH                 0x00000001

#define _CNSTATF_CNSTATF1_POSITION               0x00000001
#define _CNSTATF_CNSTATF1_MASK                   0x00000002
#define _CNSTATF_CNSTATF1_LENGTH                 0x00000001

#define _CNSTATF_CNSTATF5_POSITION               0x00000005
#define _CNSTATF_CNSTATF5_MASK                   0x00000020
#define _CNSTATF_CNSTATF5_LENGTH                 0x00000001

#define _CNSTATF_CNSTATF6_POSITION               0x00000006
#define _CNSTATF_CNSTATF6_MASK                   0x00000040
#define _CNSTATF_CNSTATF6_LENGTH                 0x00000001

#define _CNSTATF_CNSTATF7_POSITION               0x00000007
#define _CNSTATF_CNSTATF7_MASK                   0x00000080
#define _CNSTATF_CNSTATF7_LENGTH                 0x00000001

#define _CNSTATF_CNSTATF9_POSITION               0x00000009
#define _CNSTATF_CNSTATF9_MASK                   0x00000200
#define _CNSTATF_CNSTATF9_LENGTH                 0x00000001

#define _CNSTATF_CNSTATF10_POSITION              0x0000000A
#define _CNSTATF_CNSTATF10_MASK                  0x00000400
#define _CNSTATF_CNSTATF10_LENGTH                0x00000001

#define _CNSTATF_CNSTATF12_POSITION              0x0000000C
#define _CNSTATF_CNSTATF12_MASK                  0x00001000
#define _CNSTATF_CNSTATF12_LENGTH                0x00000001

#define _CNSTATF_CNSTATF13_POSITION              0x0000000D
#define _CNSTATF_CNSTATF13_MASK                  0x00002000
#define _CNSTATF_CNSTATF13_LENGTH                0x00000001

