Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/include/proc/p32mk0512gpg064.h
#define _ADCSYSCFG1_AN39_POSITION                0x00000007
#define _ADCSYSCFG1_AN39_MASK                    0x00000080
#define _ADCSYSCFG1_AN39_LENGTH                  0x00000001

#define _ADCSYSCFG1_AN40_POSITION                0x00000008
#define _ADCSYSCFG1_AN40_MASK                    0x00000100
#define _ADCSYSCFG1_AN40_LENGTH                  0x00000001

#define _ADCSYSCFG1_AN41_POSITION                0x00000009
#define _ADCSYSCFG1_AN41_MASK                    0x00000200
#define _ADCSYSCFG1_AN41_LENGTH                  0x00000001

#define _ADCSYSCFG1_AN45_POSITION                0x0000000D
#define _ADCSYSCFG1_AN45_MASK                    0x00002000
#define _ADCSYSCFG1_AN45_LENGTH                  0x00000001

#define _ADCSYSCFG1_AN46_POSITION                0x0000000E
#define _ADCSYSCFG1_AN46_MASK                    0x00004000
#define _ADCSYSCFG1_AN46_LENGTH                  0x00000001

#define _ADCSYSCFG1_AN47_POSITION                0x0000000F
#define _ADCSYSCFG1_AN47_MASK                    0x00008000
#define _ADCSYSCFG1_AN47_LENGTH                  0x00000001

#define _ADCSYSCFG1_AN48_POSITION                0x00000010
#define _ADCSYSCFG1_AN48_MASK                    0x00010000
#define _ADCSYSCFG1_AN48_LENGTH                  0x00000001

#define _ADCSYSCFG1_AN49_POSITION                0x00000011
#define _ADCSYSCFG1_AN49_MASK                    0x00020000
#define _ADCSYSCFG1_AN49_LENGTH                  0x00000001

#define _ADCSYSCFG1_AN50_POSITION                0x00000012
#define _ADCSYSCFG1_AN50_MASK                    0x00040000
#define _ADCSYSCFG1_AN50_LENGTH                  0x00000001

#define _ADCSYSCFG1_AN51_POSITION                0x00000013
#define _ADCSYSCFG1_AN51_MASK                    0x00080000
#define _ADCSYSCFG1_AN51_LENGTH                  0x00000001

#define _ADCSYSCFG1_AN52_POSITION                0x00000014
#define _ADCSYSCFG1_AN52_MASK                    0x00100000
#define _ADCSYSCFG1_AN52_LENGTH                  0x00000001

#define _ADCSYSCFG1_AN53_POSITION                0x00000015
#define _ADCSYSCFG1_AN53_MASK                    0x00200000
#define _ADCSYSCFG1_AN53_LENGTH                  0x00000001

#define _RTCCON_RTCOE_POSITION                   0x00000000
#define _RTCCON_RTCOE_MASK                       0x00000001
#define _RTCCON_RTCOE_LENGTH                     0x00000001

#define _RTCCON_HALFSEC_POSITION                 0x00000001
#define _RTCCON_HALFSEC_MASK                     0x00000002
#define _RTCCON_HALFSEC_LENGTH                   0x00000001

#define _RTCCON_RTCSYNC_POSITION                 0x00000002
#define _RTCCON_RTCSYNC_MASK                     0x00000004
#define _RTCCON_RTCSYNC_LENGTH                   0x00000001

#define _RTCCON_RTCWREN_POSITION                 0x00000003
#define _RTCCON_RTCWREN_MASK                     0x00000008
#define _RTCCON_RTCWREN_LENGTH                   0x00000001

#define _RTCCON_RTCCLKON_POSITION                0x00000006
#define _RTCCON_RTCCLKON_MASK                    0x00000040
#define _RTCCON_RTCCLKON_LENGTH                  0x00000001

#define _RTCCON_RTCOUTSEL_POSITION               0x00000007
#define _RTCCON_RTCOUTSEL_MASK                   0x00000180
#define _RTCCON_RTCOUTSEL_LENGTH                 0x00000002

#define _RTCCON_RTCCLKSEL_POSITION               0x00000009
#define _RTCCON_RTCCLKSEL_MASK                   0x00000600
#define _RTCCON_RTCCLKSEL_LENGTH                 0x00000002

#define _RTCCON_SIDL_POSITION                    0x0000000D
#define _RTCCON_SIDL_MASK                        0x00002000
#define _RTCCON_SIDL_LENGTH                      0x00000001

#define _RTCCON_ON_POSITION                      0x0000000F
#define _RTCCON_ON_MASK                          0x00008000
#define _RTCCON_ON_LENGTH                        0x00000001

#define _RTCCON_CAL_POSITION                     0x00000010
#define _RTCCON_CAL_MASK                         0x03FF0000
#define _RTCCON_CAL_LENGTH                       0x0000000A

#define _RTCCON_w_POSITION                       0x00000000
#define _RTCCON_w_MASK                           0xFFFFFFFF
#define _RTCCON_w_LENGTH                         0x00000020

#define _RTCALRM_ARPT_POSITION                   0x00000000
#define _RTCALRM_ARPT_MASK                       0x000000FF
#define _RTCALRM_ARPT_LENGTH                     0x00000008

#define _RTCALRM_AMASK_POSITION                  0x00000008
#define _RTCALRM_AMASK_MASK                      0x00000F00
#define _RTCALRM_AMASK_LENGTH                    0x00000004

#define _RTCALRM_ALRMSYNC_POSITION               0x0000000C
#define _RTCALRM_ALRMSYNC_MASK                   0x00001000
#define _RTCALRM_ALRMSYNC_LENGTH                 0x00000001

#define _RTCALRM_PIV_POSITION                    0x0000000D
#define _RTCALRM_PIV_MASK                        0x00002000
#define _RTCALRM_PIV_LENGTH                      0x00000001

#define _RTCALRM_CHIME_POSITION                  0x0000000E
#define _RTCALRM_CHIME_MASK                      0x00004000
#define _RTCALRM_CHIME_LENGTH                    0x00000001

#define _RTCALRM_ALRMEN_POSITION                 0x0000000F
#define _RTCALRM_ALRMEN_MASK                     0x00008000
#define _RTCALRM_ALRMEN_LENGTH                   0x00000001

#define _RTCALRM_w_POSITION                      0x00000000
#define _RTCALRM_w_MASK                          0xFFFFFFFF
#define _RTCALRM_w_LENGTH                        0x00000020

#define _RTCTIME_SEC01_POSITION                  0x00000008
#define _RTCTIME_SEC01_MASK                      0x00000F00
#define _RTCTIME_SEC01_LENGTH                    0x00000004

#define _RTCTIME_SEC10_POSITION                  0x0000000C
#define _RTCTIME_SEC10_MASK                      0x0000F000
#define _RTCTIME_SEC10_LENGTH                    0x00000004

#define _RTCTIME_MIN01_POSITION                  0x00000010
#define _RTCTIME_MIN01_MASK                      0x000F0000
#define _RTCTIME_MIN01_LENGTH                    0x00000004

#define _RTCTIME_MIN10_POSITION                  0x00000014
#define _RTCTIME_MIN10_MASK                      0x00F00000
#define _RTCTIME_MIN10_LENGTH                    0x00000004

